export const eventData = {
  event: "Қыз ұзату",

  bride: "Көркемай",

  date: "15 Тамыз 2026",

  time: "18:00",

  venue: {
    name: "Grand Palace",
    address: "Астана, Қабанбай батыр 12",
    map: "https://maps.google.com",
  },

  countdownDate: "2026-08-15T18:00:00",

  welcome:
    "Сіздерді аяулы қызымыздың «Қыз ұзату» салтанатына арналған ақ дастарханымыздың қадірлі қонағы болуға шақырамыз.",

  story: [
    "Қыз баланың өміріндегі ең маңызды күндерінің бірі — туған шаңырағымен қоштасу сәті.",
    "Осы қуанышты кеште сіздерді біздің отбасымыздың ерекше мерекесіне ортақтасуға шақырамыз.",
  ],

  timeline: [
    {
      time: "17:30",
      title: "Қонақтарды қарсы алу",
    },
    {
      time: "18:00",
      title: "Салтанатты кештің басталуы",
    },
    {
      time: "19:00",
      title: "Құттықтаулар",
    },
    {
      time: "21:00",
      title: "Би кеші",
    },
  ],

  dressCode: [
    "#e9e5dc",
    "#d8d2c3",
    "#f8f8f8",
    "#d4af37",
    "#c7b299",
  ],

  wishes:
    "Қуанышымызды бөлісіп, осы ерекше кештің қадірлі қонағы боласыздар деп сенеміз.",
};